Repository: mugubr/django_base
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: You must be logged in to access this page.
pt_br: Você precisa estar logado para acessar esta página.

source: You must be an admin to access this page.
pt_br: Você precisa ser um administrador para acessar esta página.

source: You must be a superuser to access this page.
pt_br: Você precisa ser um superusuário para acessar esta página.

source: You must have a verified profile to access this page. Please complete your profile and wait for verification.
pt_br: Você precisa ter um perfil verificado para acessar esta página. Por favor, complete seu perfil e aguarde a verificação.

source: You are already logged in.
pt_br: Você já está logado.

source: Username or Email
pt_br: Usuário ou E-mail

source: Password
pt_br: Senha

source: First Name
pt_br: Primeiro Nome

source: Last Name
pt_br: Sobrenome

source: Username
pt_br: Nome de usuário

source: Confirm Password
pt_br: Confirmar Senha

source: Tell us about yourself...
pt_br: Conte-nos sobre você...

source: City
pt_br: Cidade

source: Country
pt_br: País

source: This email is already in use.
pt_br: Este e-mail já está sendo utilizado.

source: Name
pt_br: Nome

source: Price
pt_br: Preço

source: Stock
pt_br: Estoque

source: Category
pt_br: Categoria

source: Enter the product name
pt_br: Digite o nome do produto

source: Enter the product price
pt_br: Digite o preço do produto

source: Enter the stock quantity
pt_br: Digite a quantidade em estoque

source: Select a category (optional)
pt_br: Selecione uma categoria (opcional)

source: Hold Ctrl/Cmd to select multiple tags
pt_br: Segure Ctrl/Cmd para selecionar múltiplas tags

source: Price must be positive.
pt_br: O preço deve ser positivo.

source: Timestamp when the record was created
pt_br: Data e hora em que o registro foi criado

source: Timestamp when the record was last updated
pt_br: Data e hora da última atualização do registro

source: Is Deleted
pt_br: Está Deletado

source: Indicates if the record is soft deleted
pt_br: Indica se o registro foi deletado (soft delete)

source: Timestamp when the record was deleted
pt_br: Data e hora em que o registro foi deletado

source: User who created this record
pt_br: Usuário que criou este registro

source: User who last updated this record
pt_br: Usuário que atualizou este registro pela última vez

source: Is Published
pt_br: Está Publicado

source: Indicates if the record is published
pt_br: Indica se o registro está publicado

source: Published At
pt_br: Publicado em

source: Timestamp when the record was published
pt_br: Data e hora em que o registro foi publicado

source: You don't have permission to access this resource.
pt_br: Você não tem permissão para acessar este recurso.

source: The name of the product (max 200 characters) / Nome do produto (máx 200 caracteres)
pt_br: O nome do produto (máx 200 caracteres) / Nome do produto (máx 200 caracteres)

source: Product price in currency units / Preço do produto em unidades monetárias
pt_br: Preço do produto em unidades monetárias / Preço do produto em unidades monetárias

source: Product stock quantity / Quantidade em estoque do produto
pt_br: Quantidade em estoque do produto / Quantidade em estoque do produto

source: Product tags / Tags do produto
pt_br: Tags do produto / Tags do produto

source: Product
pt_br: Produto

source: Products
pt_br: Produtos

source: User
pt_br: Usuário

source: Related Django user / Usuário Django relacionado
pt_br: Usuário Django relacionado / Usuário Django relacionado

source: Biography
pt_br: Biografia

source: User biography (max 500 chars) / Biografia do usuário (máx 500 chars)
pt_br: Biografia do usuário (máx 500 caracteres) / Biografia do usuário (máx 500 chars)

source: Profile picture / Foto de perfil
pt_br: Foto de perfil / Foto de perfil

source: Phone
pt_br: Celular

source: Phone number with country code / Número de telefone com código do país
pt_br: Número de telefone com código do país / Número de telefone com código do país

source: Birth date
pt_br: Data de nascimento

source: User's birth date / Data de nascimento do usuário
pt_br: Data de nascimento do usuário / Data de nascimento do usuário

source: User's city / Cidade do usuário
pt_br: Cidade do usuário / Cidade do usuário

source: User's country / País do usuário
pt_br: País do usuário / País do usuário

source: Website
pt_br: Site

source: Personal website or portfolio / Website pessoal ou portfólio
pt_br: Website pessoal ou portfólio / Website pessoal ou portfólio

source: Verified
pt_br: Verificado

source: Indicates if user is verified / Indica se usuário é verificado
pt_br: Indica se o usuário é verificado / Indica se usuário é verificado

source: User Profile
pt_br: Perfil do Usuário

source: User Profiles
pt_br: Perfis de Usuário

source: Category name (unique) / Nome da categoria (único)
pt_br: Nome da categoria (único) / Nome da categoria (único)

source: URL-friendly identifier (auto-generated) / Identificador amigável para URL (auto-gerado)
pt_br: Identificador amigável para URL (auto-gerado) / Identificador amigável para URL (auto-gerado)

source: Description
pt_br: Descrição

source: Category description / Descrição da categoria
pt_br: Descrição da categoria / Descrição da categoria

source: Parent category
pt_br: Categoria pai

source: Parent category for hierarchical structure / Categoria pai para estrutura hierárquica
pt_br: Categoria pai para estrutura hierárquica / Categoria pai para estrutura hierárquica

source: Categories
pt_br: Categorias

source: Tag name (unique) / Nome da tag (único)
pt_br: Nome da tag (único) / Nome da tag (único)

source: Color
pt_br: Cor

source: Hex color code for badge display / Código de cor hex para exibição do badge
pt_br: Código de cor hexadecimal para exibição do badge / Código de cor hex para exibição do badge

source: Enter a valid phone number. Formats: +55 11 98765-4321, (11) 98765-4321, or 11987654321
pt_br: Digite um número de telefone válido. Formatos: +55 11 98765-4321, (11) 98765-4321, ou 11987654321

source: Phone number must have between 10 and 15 digits.
pt_br: O número de telefone deve ter entre 10 e 15 dígitos.

source: Enter a valid CPF number.
pt_br: Digite um número de CPF válido.

source: Enter a valid YouTube URL.
pt_br: Digite uma URL válida do YouTube.

source: Date must be in the future.
pt_br: A data deve ser no futuro.

source: Date must be in the past.
pt_br: A data deve ser no passado.

source: Username can only contain letters, numbers, underscores, and hyphens.
pt_br: O nome de usuário pode conter apenas letras, números, underscores e hífens.

source: Slug can only contain lowercase letters, numbers, and hyphens.
pt_br: O slug pode conter apenas letras minúsculas, números e hífens.

source: Enter a valid hex color code (e.g., #FF5733).
pt_br: Digite um código de cor hexadecimal válido (ex: #FF5733).

source: Welcome to Django Base
pt_br: Bem-vindo ao Django Base

source: Welcome back, {username}!
pt_br: Bem-vindo de volta, {username}!

source: Invalid username or password.
pt_br: Nome de usuário ou senha inválidos.

source: Please correct the errors below.
pt_br: Por favor, corrija os erros abaixo.

source: Login
pt_br: Entrar

source: Account created successfully! Welcome, {username}!
pt_br: Conta criada com sucesso! Bem-vindo, {username}!

source: Register
pt_br: Registre-se

source: Goodbye, {username}!
pt_br: Até logo, {username}!

source: Profile updated successfully!
pt_br: Perfil atualizado com sucesso!

source: My Profile
pt_br: Meu Perfil

source: Project Information
pt_br: Informações do Projeto

source: Product created successfully!
pt_br: Produto criado com sucesso!

source: Create Product
pt_br: Criar Produto

source: Created at
pt_br: Criado em

source: Home
pt_br: Início

source: Project
pt_br: Projeto

source: Monitoring
pt_br: Monitoramento

source: Health Check
pt_br: Verificação de Saúde do Sistema

source: API Docs
pt_br: Docs da API

source: Profile
pt_br: Perfil

source: Logout
pt_br: Sair

source: All rights reserved
pt_br: Todos os direitos reservados

source: Project Info
pt_br: Info do Projeto

source: Terms
pt_br: Termos

source: Terms and Conditions
pt_br: Termos e Condições

source: 1. Acceptance of Terms
pt_br: 1. Aceite dos Termos

source: By accessing and using this Django Base template, you accept and agree to be bound by the terms and provision of this agreement.
pt_br: Ao acessar e usar este template Django Base, você aceita e concorda em estar vinculado aos termos e provisões deste acordo.

source: 2. Use License
pt_br: 2. Licença de Uso

source: This is an open-source template. Permission is granted to use, copy, modify, and distribute this software and its documentation for any purpose, provided that the above copyright notice and this permission notice appear in all copies.
pt_br: Este é um template de código aberto. É concedida permissão para usar, copiar, modificar e distribuir este software e sua documentação para qualquer finalidade, desde que o aviso de copyright acima e este aviso de permissão apareçam em todas as cópias.

source: 3. Disclaimer
pt_br: 3. Isenção de Responsabilidade

source: This template is provided 'as is' without warranty of any kind, express or implied. In no event shall the authors be liable for any claim, damages or other liability arising from the use of the software.
pt_br: Este template é fornecido 'como está' sem garantia de qualquer tipo, expressa ou implícita. Em nenhum caso os autores serão responsáveis por qualquer reivindicação, danos ou outra responsabilidade decorrente do uso do software.

source: 4. Privacy
pt_br: 4. Privacidade

source: We respect your privacy. Any personal information collected will be handled in accordance with applicable data protection laws.
pt_br: Respeitamos sua privacidade. Qualquer informação pessoal coletada será tratada de acordo com as leis de proteção de dados aplicáveis.

source: 5. Modifications
pt_br: 5. Modificações

source: We reserve the right to modify these terms at any time. Continued use of the template constitutes acceptance of modified terms.
pt_br: Reservamo-nos o direito de modificar estes termos a qualquer momento. O uso continuado do template constitui aceitação dos termos modificados.

source: Close
pt_br: Fechar

source: Showing %(start)s to %(end)s of %(total)s items
pt_br: Mostrando %(start)s a %(end)s de %(total)s itens

source: About Django Base
pt_br: Sobre o Django Base

source: A production-ready Django template
pt_br: Um template Django pronto para produção

source: Technology Stack
pt_br: Tecnologias

source: Features
pt_br: Recursos

source: REST API with DRF
pt_br: API REST com DRF

source: Authentication System
pt_br: Sistema de Autenticação

source: Monitoring & Observability
pt_br: Monitoramento & Observabilidade

source: Pre-commit Hooks
pt_br: Hooks de Pre-commit

source: Internationalization (i18n)
pt_br: Internacionalização (i18n)

source: Developer
pt_br: Desenvolvedor

source: Full Stack Developer
pt_br: Desenvolvedor Full Stack

source: View GitHub Profile
pt_br: Ver Perfil no GitHub

source: This project was created as a production-ready Django template with best practices, modern tooling, and comprehensive documentation. Feel free to use it as a starting point for your own projects!
pt_br: Este projeto foi criado como um template Django pronto para produção com melhores práticas, ferramentas modernas e documentação abrangente. Sinta-se à vontade para usá-lo como ponto de partida para seus próprios projetos!

source: Repository
pt_br: Repositório

source: Source Code
pt_br: Código Fonte

source: License
pt_br: Licença

source: Free to use and modify
pt_br: Livre para usar e modificar

source: Report Issues
pt_br: Reportar Problemas

source: Fork Repository
pt_br: Fazer Fork do Repositório

source: Star on GitHub
pt_br: Dar Star no GitHub

source: Contributing
pt_br: Contribuindo

source: Contributions are welcome! If you'd like to improve this project, please:
pt_br: Contribuições são bem-vindas! Se você gostaria de melhorar este projeto, por favor:

source: Fork the repository
pt_br: Faça fork do repositório

source: Create a feature branch
pt_br: Crie uma branch de feature

source: Commit your changes
pt_br: Faça commit das suas mudanças

source: Push to the branch
pt_br: Faça push para a branch

source: Open a Pull Request
pt_br: Abra um Pull Request

source: Questions or suggestions?
pt_br: Dúvidas ou sugestões?

source: Feel free to open an issue on GitHub!
pt_br: Sinta-se à vontade para abrir uma issue no GitHub!

source: Back to Home
pt_br: Voltar ao Início

source: System Health Check
pt_br: Verificação de Saúde do Sistema

source: Real-time system status and diagnostics
pt_br: Status do sistema e diagnósticos em tempo real

source: Loading...
pt_br: Carregando...

source: System Information
pt_br: Informações do Sistema

source: Auto-refresh every 30 seconds
pt_br: Atualização automática a cada 30 segundos

source: System Healthy
pt_br: Sistema Saudável

source: System Issues Detected
pt_br: Problemas do Sistema Detectados

source: Unable to Fetch Status
pt_br: Não Foi Possível Obter o Status

source: ERROR
pt_br: ERRO

source: Version
pt_br: Versão

source: Environment
pt_br: Ambiente

source: Last Check
pt_br: Última Verificação

source: Portfolio
pt_br: Portfólio

source: Bio
pt_br: Biografia

source: Featured Project
pt_br: Projeto em Destaque

source: A production-ready Django boilerplate with Docker, DRF, authentication system, and complete features. Includes REST API, JWT authentication, monitoring with Prometheus/Grafana, and bilingual documentation (EN/PT).
pt_br: Um boilerplate Django pronto para produção com Docker, DRF, sistema de autenticação e recursos completos. Inclui API REST, autenticação JWT, monitoramento com Prometheus/Grafana e documentação bilíngue (EN/PT).

source: Project Details
pt_br: Detalhes do Projeto

source: View on GitHub
pt_br: Ver no GitHub

source: Skills & Technologies
pt_br: Habilidades & Tecnologias

source: DevOps & Tools
pt_br: DevOps & Ferramentas

source: Best Practices
pt_br: Melhores Práticas

source: Metrics
pt_br: Métricas

source: Dashboards
pt_br: Painéis

source: Get in Touch
pt_br: Entre em Contato

source: Interested in collaborating or have questions? Feel free to reach out!
pt_br: Interessado em colaborar ou tem dúvidas? Sinta-se à vontade para entrar em contato!

source: View GitHub
pt_br: Ver GitHub

source: Send Email
pt_br: Enviar E-mail

source: Active
pt_br: Ativo

source: Cancel
pt_br: Cancelar

source: Error!
pt_br: Erro!

source: Current stock quantity
pt_br: Quantidade atual em estoque

source: Created by
pt_br: Criado por

source: Last updated by
pt_br: Última atualização por

source: Updated at
pt_br: Atualizado em

source: Required fields
pt_br: Campos obrigatórios

source: Browse our product catalog
pt_br: Navegue por nosso catálogo de produtos

source: Filters
pt_br: Filtros

source: All Categories
pt_br: Todas as Categorias

source: Price Range
pt_br: Faixa de Preço

source: Min
pt_br: Mín

source: Max
pt_br: Máx

source: Apply Filters
pt_br: Aplicar Filtros

source: Clear
pt_br: Limpar

source: Deleted
pt_br: Deletado

source: Edit
pt_br: Editar

source: No products found
pt_br: Nenhum produto encontrado

source: Django Base Project
pt_br: Projeto Django Base

source: Production-Ready Django Boilerplate
pt_br: Boilerplate Django Pronto para Produção

source: Django 5.2 with Django REST Framework for building robust APIs
pt_br: Django 5.2 com Django REST Framework para construir APIs robustas

source: Docker Ready
pt_br: Dockerizado

source: Fully containerized with Docker Compose for easy development and deployment
pt_br: Totalmente containerizado com Docker Compose para desenvolvimento e deploy fáceis

source: Production-grade database with optimized configurations
pt_br: Banco de dados de nível de produção com configurações otimizadas

source: Redis Cache
pt_br: Cache Redis

source: High-performance caching and session storage
pt_br: Cache de alta performance e armazenamento de sessão

source: JWT Authentication
pt_br: Autenticação JWT

source: Stateless authentication with refresh tokens and blacklisting
pt_br: Autenticação stateless com tokens de refresh e blacklisting

source: Prometheus metrics and Grafana dashboards for observability
pt_br: Métricas Prometheus e painéis Grafana para observabilidade

source: Architecture & Design Principles
pt_br: Arquitetura & Princípios de Design

source: Bilingual by Default
pt_br: Bilíngue por Padrão

source: All code, documentation, and templates are in English and Portuguese
pt_br: Todo código, documentação e templates estão em Inglês e Português

source: Security First
pt_br: Segurança em Primeiro Lugar

source: HSTS, secure cookies, rate limiting, JWT tokens, Bandit security analysis
pt_br: HSTS, cookies seguros, limitação de taxa, tokens JWT, análise de segurança Bandit

source: Developer Experience
pt_br: Experiência do Desenvolvedor

source: Automated setup script, pre-commit hooks, comprehensive documentation
pt_br: Script de configuração automatizado, hooks de pre-commit, documentação abrangente

source: Performance Optimized
pt_br: Otimizado para Performance

source: Redis caching, optimized queries, Gzip compression, database indexes
pt_br: Cache Redis, queries otimizadas, compressão Gzip, índices de banco de dados

source: Soft Deletion
pt_br: Exclusão Suave

source: Data never permanently deleted - maintains referential integrity
pt_br: Dados nunca são excluídos permanentemente - mantém integridade referencial

source: Technologies & Documentation
pt_br: Tecnologias & Documentação

source: Database & Cache
pt_br: Banco de Dados & Cache

source: Code Quality
pt_br: Qualidade de Código

source: Key Components
pt_br: Componentes Principais

source: Models
pt_br: Modelos

source: API Endpoints
pt_br: Endpoints da API

source: Utilities
pt_br: Utilitários

source: Infrastructure
pt_br: Infraestrutura

source: Getting Started
pt_br: Começando

source: Clone and run the project in minutes:
pt_br: Clone e execute o projeto em minutos:

source: Automated setup
pt_br: Configuração automatizada

source: Access
pt_br: Acesso

source: The setup script handles everything: Docker setup, migrations, superuser creation, and database seeding.
pt_br: O script de configuração cuida de tudo: configuração Docker, migrações, criação de superusuário e seed do banco de dados.

source: Repository & License
pt_br: Repositório & Licença

source: Contributions are welcome! See CONTRIBUTING.md for guidelines:
pt_br: Contribuições são bem-vindas! Veja CONTRIBUTING.md para diretrizes:

source: Make your changes with tests
pt_br: Faça suas alterações com testes

source: Run linting and formatting
pt_br: Execute linting e formatação

source: Submit a Pull Request
pt_br: Envie um Pull Request

source: Back to Portfolio
pt_br: Voltar ao Portfólio

source: Access your account
pt_br: Acesse sua conta

source: Enter your username or email address
pt_br: Digite seu nome de usuário ou endereço de e-mail

source: Remember me for 2 weeks
pt_br: Lembre-se de mim por 2 semanas

source: Forgot your password?
pt_br: Esqueceu sua senha?

source: Don't have an account?
pt_br: Não tem uma conta?

source: Register here
pt_br: Cadastre-se aqui

source: Your connection is secure. We never store your password in plain text.
pt_br: Sua conexão é segura. Nunca armazenamos sua senha em texto simples.

source: API Authentication
pt_br: Autenticação da API

source: For API access, use JWT tokens. See documentation:
pt_br: Para acesso à API, use tokens JWT. Veja a documentação:

source: Member Since
pt_br: Membro Desde

source: Edit Profile
pt_br: Editar Perfil

source: Basic Information
pt_br: Informações Básicas

source: Email Address
pt_br: Endereço de E-mail

source: Profile Details
pt_br: Detalhes do Perfil

source: Tell us about yourself
pt_br: Conte-nos sobre você

source: Profile Picture
pt_br: Foto de Perfil

source: Current
pt_br: Atual

source: View current avatar
pt_br: Ver avatar atual

source: Phone Number
pt_br: Número de Telefone

source: Birth Date
pt_br: Data de Nascimento

source: Save Changes
pt_br: Salvar Alterações

source: Create Account
pt_br: Criar Conta

source: Join us today!
pt_br: Junte-se a nós!

source: Required. 150 characters or fewer. Letters, digits and @/./+/-/_ only.
pt_br: Obrigatório. 150 caracteres ou menos. Apenas letras, dígitos e @/./+/-/_.

source: We'll never share your email with anyone else.
pt_br: Nunca compartilharemos seu e-mail com terceiros.

source: Your password can't be too similar to your other personal information.
pt_br: Sua senha não pode ser muito similar às suas outras informações pessoais.

source: Your password must contain at least 8 characters.
pt_br: Sua senha deve conter pelo menos 8 caracteres.

source: Your password can't be a commonly used password.
pt_br: Sua senha não pode ser uma senha comumente usada.

source: Your password can't be entirely numeric.
pt_br: Sua senha não pode ser inteiramente numérica.

source: Enter the same password as before, for verification.
pt_br: Digite a mesma senha de antes, para verificação.

source: I agree to the
pt_br: Eu concordo com os

source: Already have an account?
pt_br: Já tem uma conta?

source: Login here
pt_br: Faça login
